class ArrayDemo
{
	public static void main(String [] args)
	{
		//元素类型 [] 数组名 = new 元素类型[元素个数或数组长度]

		int[] arr = new int[10];//元素的个数
		arr[0]=89;
		System.out.println(arr[0]);
		
	}
	
}


/*
内存划分：
1、寄存器  cpu管理
2、本地方法区  与所在系统相关 ,本地系统使用
3、方法区  
4、栈内存  *
	A、存储的都是局部变量。
	B、变量所属的作用域一旦结束，该变量自动释放。

	局部代码块 中的变量，出来以后就释放了。用来限定局部变量的生命周期。

	类的属性不是局部变量，不存储在这里。
	for(int x=0;x<4;x++){} //x是局部变量
5、堆内存	*
	存数的数组和对象{其实数组就是对象} 凡是new建立的都在堆中存储。实体
    实体是 用于封装多个数据。
	
	堆内的数据会默认初始化。

	方法进栈，里面的局部变量也进栈。 int [] arr {在栈中} = new int [3];{在堆中}
	特点：
	1、每个实体都有一个首地址值。0x0045
	2、堆内存中的每个变量都有默认初始值，根据类型的不同而不同。整数0，小数或者0.0f，boolean false， char '\u0000'。null
	3、变量中存储 实体的首地址。0x0045 ，引用类型，指向实体。 java 成长自 C++
	4、垃圾回收机制。
	
	没有指向 的实体，会视为垃圾，系统自动回收。不定时回收。


**/
